# ViewGraphSchedGridAppearance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewGraphSchedGridAppearance Property
ParameterTypeId Class See Also
---
"Grid Appearance"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewGraphSchedGridAppearance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewGraphSchedGridAppearance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewGraphSchedGridAppearance {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace